export default {
  route: {
    dashboard: 'Панель управления',
    documentation: 'Документация',
    guide: 'Руководство',
    permission: 'Разрешения',
    pagePermission: 'Разрешения страницы',
    rolePermission: 'Разрешения роли',
    directivePermission: 'Разрешения директивы',
    icons: 'Иконки',
    components: 'Компоненты',
    tinymce: 'Tinymce',
    markdown: 'Markdown',
    jsonEditor: 'JSON редактор',
    dndList: 'Dnd список',
    splitPane: 'SplitPane',
    avatarUpload: 'Загрузка аватара',
    dropzone: 'Dropzone',
    sticky: 'Sticky',
    countTo: 'Count To',
    componentMixin: 'Mixin',
    backToTop: 'Наверх',
    dragDialog: 'Перетаскивание диалога',
    dragSelect: 'Перетаскивание выбора',
    dragKanban: 'Перетаскивание Kanban',
    charts: 'Графики',
    keyboardChart: 'Клавиатурный график',
    lineChart: 'Линейный график',
    mixChart: 'Смешанный график',
    example: 'Пример',
    nested: 'Вложенные маршруты',
    menu1: 'Меню 1',
    'menu1-1': 'Меню 1-1',
    'menu1-2': 'Меню 1-2',
    'menu1-2-1': 'Меню 1-2-1',
    'menu1-2-2': 'Меню 1-2-2',
    'menu1-3': 'Меню 1-3',
    menu2: 'Меню 2',
    Table: 'Таблица',
    dynamicTable: 'Динамическая таблица',
    dragTable: 'Перетаскиваемая таблица',
    inlineEditTable: 'Встроенное редактирование',
    complexTable: 'Сложная таблица',
    tab: 'Вкладка',
    form: 'Форма',
    createArticle: 'Создать статью',
    editArticle: 'Редактировать статью',
    articleList: 'Список статей',
    errorPages: 'Страницы ошибок',
    page401: '401',
    page404: '404',
    errorLog: 'Журнал ошибок',
    excel: 'Excel',
    exportExcel: 'Экспорт в Excel',
    selectExcel: 'Экспорт выбранного',
    mergeHeader: 'Объединение заголовков',
    uploadExcel: 'Загрузка Excel',
    zip: 'Zip',
    pdf: 'PDF',
    exportZip: 'Экспорт в Zip',
    theme: 'Тема',
    clipboardDemo: 'Буфер обмена',
    i18n: 'I18n',
    externalLink: 'Внешняя ссылка',
    profile: 'Профиль'
  },
  navbar: {
    dashboard: 'Панель управления',
    github: 'Github',
    logOut: 'Выйти',
    profile: 'Профиль',
    theme: 'Тема',
    size: 'Глобальный размер'
  },
  login: {
    title: 'Форма входа',
    logIn: 'Войти',
    username: 'Имя пользователя',
    password: 'Пароль',
    any: 'любой',
    thirdparty: 'Или войти через',
    thirdpartyTips: 'Не может быть смоделировано локально, поэтому, пожалуйста, объедините с вашей собственной бизнес-симуляцией!'
  },
  documentation: {
    documentation: 'Документация',
    github: 'Github репозиторий'
  },
  permission: {
    addRole: 'Новая роль',
    editPermission: 'Редактировать',
    roles: 'Ваши роли',
    switchRoles: 'Переключить роли',
    tips: 'В некоторых случаях использование v-permission не будет иметь эффекта. Например: Element-UI el-tab или el-table-column и другие сцены, которые динамически отображают dom. Вы можете сделать это только с v-if.',
    delete: 'Удалить',
    confirm: 'Подтвердить',
    cancel: 'Отмена'
  },
  guide: {
    description: 'Страница руководства полезна для людей, которые впервые вошли в проект. Вы можете кратко представить функции проекта. Демо основано на ',
    button: 'Показать руководство'
  },
  components: {
    documentation: 'Документация',
    tinymceTips: 'Rich text является основной функцией бэкенда управления, но в то же время это место с множеством проблем. В процессе выбора rich text я также сделал много обходных путей. Общие rich text на рынке были в основном использованы, и я в конечном итоге выбрал Tinymce.',
    dropzoneTips: 'Поскольку мой бизнес имеет особые потребности и должен загружать изображения в qiniu, вместо третьей стороны я выбрал инкапсуляцию самостоятельно. Это очень просто, вы можете увидеть подробный код в @/components/Dropzone.',
    stickyTips: 'когда страница прокручивается до заданной позиции, она будет прилипать к верху.',
    backToTopTips1: 'Когда страница прокручивается до указанной позиции, кнопка "Наверх" появляется в правом нижнем углу',
    backToTopTips2: 'Вы можете настроить стиль кнопки, показать/скрыть, высоту появления, высоту возврата. Если вам нужна текстовая подсказка, вы можете использовать element-ui el-tooltip элементы снаружи',
    imageUploadTips: 'Поскольку я использовал только vue@1 версию, и она в настоящее время несовместима с mockjs, я изменил ее сам, и если вы собираетесь использовать ее, лучше использовать официальную версию.'
  },
  table: {
    dynamicTips1: 'Фиксированный заголовок, отсортированный по порядку заголовка',
    dynamicTips2: 'Нефиксированный заголовок, отсортированный по порядку клика',
    dragTips1: 'Порядок по умолчанию',
    dragTips2: 'Порядок после перетаскивания',
    title: 'Заголовок',
    importance: 'Важность',
    type: 'Тип',
    remark: 'Примечание',
    search: 'Поиск',
    add: 'Добавить',
    export: 'Экспорт',
    reviewer: 'рецензент',
    id: 'ID',
    date: 'Дата',
    author: 'Автор',
    readings: 'Чтения',
    status: 'Статус',
    actions: 'Действия',
    edit: 'Редактировать',
    publish: 'Опубликовать',
    draft: 'Черновик',
    delete: 'Удалить',
    cancel: 'Отмена',
    confirm: 'Подтвердить'
  },
  example: {
    warning: 'Страницы создания и редактирования не могут быть кэшированы с помощью keep-alive, потому что keep-alive include в настоящее время не поддерживает кэширование на основе маршрутов, поэтому в настоящее время кэшируется на основе имени компонента. Если вы хотите достичь аналогичного эффекта кэширования, вы можете использовать схему кэширования браузера, такую как localStorage. Или не используйте keep-alive include для кэширования всех страниц напрямую.'
  },
  errorLog: {
    tips: 'Пожалуйста, нажмите на значок ошибки в правом верхнем углу',
    description: 'Сейчас системы управления в основном в форме spa, это улучшает пользовательский опыт, но также увеличивает вероятность проблем со страницей, небольшая небрежность может привести к блокировке всей страницы. К счастью, Vue предоставляет способ перехвата обработки исключений, где вы можете обрабатывать ошибки или сообщать об исключениях.',
    documentation: 'Введение в документацию'
  },
  excel: {
    export: 'Экспорт',
    selectedExport: 'Экспорт выбранных элементов',
    placeholder: 'Пожалуйста, введите имя файла (по умолчанию excel-list)'
  },
  zip: {
    export: 'Экспорт',
    placeholder: 'Пожалуйста, введите имя файла (по умолчанию file)'
  },
  pdf: {
    tips: 'Здесь мы используем window.print() для реализации функции загрузки PDF.'
  },
  theme: {
    change: 'Изменить тему',
    documentation: 'Документация по теме',
    tips: 'Совет: Это отличается от theme-pick на navbar, это два разных способа скинирования, каждый с разными областями применения. Подробности см. в документации.'
  },
  tagsView: {
    refresh: 'Обновить',
    close: 'Закрыть',
    closeOthers: 'Закрыть другие',
    closeAll: 'Закрыть все'
  },
  settings: {
    title: 'Настройки стиля страницы',
    theme: 'Цвет темы',
    tagsView: 'Открыть Tags-View',
    fixedHeader: 'Фиксированный заголовок',
    sidebarLogo: 'Логотип боковой панели'
  }
}
